tap 'homebrew/cask-versions'
tap 'vmware-tanzu/carvel'

brew 'git' # although git comes with OS X, this way we get the latest version
brew 'fpp' # facebook path picker, do a `git status | fpp` to see what it can do
brew 'shellcheck' # shell script analyzer
brew 'wget'
brew 'tfenv'
brew 'direnv'
brew 'pyenv'
brew 'kubectl'
brew 'awscli'
brew 'kapp'
brew 'kustomize'

cask 'google-chrome'
cask 'slack'
cask 'visual-studio-code' # open source text editor by Microsoft, on top of GitHub Atom
cask 'github'
cask '1password'
cask '1password-cli'
cask 'wezterm'
